<template>
    <div class="whatYouGet space">
        <div id="whatgetheader">
            <hr class="hr"> 
            <h1 class="headers">Что вы получите если выберите А-dom?</h1>
        </div>
        <WhatYouGetItem v-bind:items="getItem"/>
    </div>
</template>
<script>
import WhatYouGetItem from "./WhatYouGetItem"
export default {
    name: "whatget",
    components:{
        WhatYouGetItem
    },
    data(){
        return{
            getItem:[
                {
                    id:"01",
                    header:"Заводской комплект",
                    text: "Наши дома изготавливаются под чутким контролем на производстве, а на стройку доставляется лишь готовый комплект, который собирается за три дня"
                },
                {
                    id:"02",
                    header:"Любой тип фундамента",
                    text: "Можем построить дом на фундаментной плите УШП, объединяющей в себе несколько функций одновременно: утепленный фундамент, железобетонное перекрытие и готовый пол с прокладкой всех коммуникаций"
                },
                {
                    id:"03",
                    header:"Высокая жесткость дома",
                    text: "Несущий каркас элементов наших домов имеет двухстороннюю обшивку высокопрочными  плитными материалами с двух сторон"
                },
                {
                    id:"04",
                    header:"Полноценная вентиляция",
                    text: "Уже в базовом оснащении наши дома имеют эффективную принудительную вентиляцию с организованными притоками в каждом помещении"
                },
                {
                    id:"05",
                    header:"Высокая шумоизоляция",
                    text: "Мы используем утеплитель Эковата, который в 2 раза сильнее сдерживает звук, чем распространенный минераловатный утеплитель"
                },
                {
                    id:"06",
                    header:"Доставка в любой город",
                    text: "Домокомплект  помещается в две  стандартные еврофуры. Для расчета доставки отправьте запрос нашему менеджеру"
                }
            ]
        }
    }
}
</script>
<style scoped>
    .whatYouGet{
        position: relative;

    }
    #whatgetheader{
        display: flex;
        flex-direction: row;
        margin-bottom: 150px;
    }
    #whatgetheader h1{
        margin: 0;
        margin-top: -10px;
    }
</style>